DeftDynamics/neoPLC-arduino/boards.txt

#***************************************************************************
#boards.txt
#
#Copyright (c) 2017, Deft Dynamics
#All rights reserved.
#
#Redistribution and use in source and binary forms, with or without
#modification, are permitted provided that the following conditions are met:
#1. Redistributions of source code must retain the above copyright
#   notice, this list of conditions and the following disclaimer.
#2. Redistributions in binary form must reproduce the above copyright
#   notice, this list of conditions and the following disclaimer in the
#   documentation and/or other materials provided with the distribution.
#3. All advertising materials mentioning features or use of this software
#   must display the following acknowledgement:
#   This product includes software developed by Deft Dynamics.
#4. Neither the name of Deft Dynamics nor the
#   names of its contributors may be used to endorse or promote products
#   derived from this software without specific prior written permission.
#
#THIS SOFTWARE IS PROVIDED BY DEFT DYNAMICS ''AS IS'' AND ANY
#EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
#WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
#DISCLAIMED. IN NO EVENT SHALL DEFT DYNAMICS BE LIABLE FOR ANY
#DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
#(INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
#LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND
#ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
#(INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
#SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
#***************************************************************************

# elements of this code are based on code by Sandeep Mistry,
# released under the following license:
#***************************************************************************
# Copyright (c) 2016 Sandeep Mistry All right reserved.
# Copyright (c) 2014-2015 Arduino LLC.  All right reserved.
#
# This library is free software; you can redistribute it and/or
# modify it under the terms of the GNU Lesser General Public
# License as published by the Free Software Foundation; either
# version 2.1 of the License, or (at your option) any later version.
#
# This library is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
# See the GNU Lesser General Public License for more details.
#
# You should have received a copy of the GNU Lesser General Public
# License along with this library; if not, write to the Free Software
# Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA
#***************************************************************************


#menu setup
#################################################################################


#neoPLCv1
#################################################################################
neoPLCv1.name=neoPLC 1.0

neoPLCv1.vid.0=0x10c4
neoPLCv1.pid.0=0xea60

neoPLCv1.upload.tool=nRFgo
neoPLCv1.upload.protocol=
neoPLCv1.upload.interface=
neoPLCv1.upload.target=nrf52
neoPLCv1.upload.maximum_size=372000
#neoPLCv1.upload.setup_command=transport select swd;
#neoPLCv1.upload.use_1200bps_touch=false
#neoPLCv1.upload.wait_for_upload_port=false
#neoPLCv1.upload.native_usb=false

neoPLCv1.build.mcu=cortex-m4
neoPLCv1.build.f_cpu=16000000
neoPLCv1.build.board=NRF52_DK
neoPLCv1.build.core=nRF52
neoPLCv1.build.variant=neoPLCv1
neoPLCv1.build.variant_system_lib=
neoPLCv1.build.extra_flags=-DNRF52
neoPLCv1.build.float_flags=-mfloat-abi=softfp -mfpu=fpv4-sp-d16
neoPLCv1.build.ldscript=armgcc_s132_nrf52832_xxaa.ld
neoPLCv1.serial.restart_cmd=false

